## INF2178 Assignment 1
Dataset: 'employee_reviews.csv'

## Content
This dataset contains employee reviews separated into the following categories:  

Index: index
#### Company: Company name
Location : This dataset is global, as such it may include the country's name in parenthesis [i.e "Toronto, ON(Canada)"]. However, if the location is in the USA then it will only include the city and state[i.e "Los Angeles, CA" ]
Date Posted: in the following format MM DD, YYYY
Job-Title: This string will also include whether the reviewer is a 'Current' or 'Former' Employee at the time of the review
Summary: Short summary of employee review
Pros: Pros
Cons: Cons
#### Overall Rating: 1-5
#### Work/Life Balance Rating: 1-5
#### Culture and Values Rating: 1-5
#### Career Opportunities Rating: 1-5
#### Comp & Benefits Rating: 1-5
#### Senior Management Rating: 1-5
Helpful Review Count: A count of how many people found the review to be helpful
Link to Review : This will provide you with a direct link to the page that contains the review. However it is likely that this link will be outdated

In [1]:
import datetime
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [6]:
df = pd.read_csv('employee_reviews.csv', index_col=0, na_values='none')

In [8]:
print(df.columns)

Index(['company', 'location', 'dates', 'job-title', 'summary', 'pros', 'cons',
       'advice-to-mgmt', 'overall-ratings', 'work-balance-stars',
       'culture-values-stars', 'carrer-opportunities-stars',
       'comp-benefit-stars', 'senior-mangemnet-stars', 'helpful-count',
       'link'],
      dtype='object')

In [19]:
# Select the particular columns
df_new = df[['company', 
            'overall-ratings', 
            'work-balance-stars', 
            'culture-values-stars',
            'carrer-opportunities-stars',
            'comp-benefit-stars',
            'senior-mangemnet-stars']]

In [30]:
# show the number of rows and columns
df_new.shape

(67529, 7)

In [31]:
df_new.rename(columns={'overall-ratings':'overall', 
                     'work-balance-stars':'workBalance', 
                     'culture-values-stars':'cultureValue', 
                     'carrer-opportunities-stars':'opportunities', 
                     'comp-benefit-stars':'benefits',
                     'senior-mangemnet-stars':'management'}, inplace=True)

In [32]:
df_new.head()

,company,overall,workBalance,cultureValue,opportunities,benefits,management
1,google,5.0,4.0,5.0,5.0,4.0,5.0
2,google,4.0,2.0,3.0,3.0,5.0,3.0
3,google,5.0,5.0,4.0,5.0,5.0,4.0
4,google,5.0,2.0,5.0,5.0,4.0,5.0
5,google,5.0,5.0,5.0,5.0,5.0,5.0

In [33]:
# the number of NaN values in every column.
df_new.isnull().sum(axis = 0)

company              0
overall              0
workBalance       7160
cultureValue     13546
opportunities     7108
benefits          7161
management        7775
dtype: int64

In [50]:
# Count the number of rows which have NaN values
sum(df_new.count(axis='columns') != 7)

14307

In [54]:
df_new = df_new.dropna()
df_new.shape # 53222 + 14307 = 67529

(53222, 7)

In [56]:
df_new.isnull().sum(axis = 0)

company          0
overall          0
workBalance      0
cultureValue     0
opportunities    0
benefits         0
management       0
dtype: int64

In [57]:
df_new.to_csv('df_new.csv', encoding='utf-8')